In [1]:
#install:
#pip3.6 install mysql-connector

In [2]:
import mysql.connector as sql

In [3]:
# Sabemos os nossos bancos de dados...
mydb = sql.connect(
    host = 'localhost',
    user = 'root',
    password = '25lokinho',
    database = 'cadastro',#vamos acessar
)

In [4]:
mydb = sql.connect(
    host = 'localhost',
    user = 'root',
    password = '25lokinho',
)

In [5]:
mycursor = mydb.cursor()

In [6]:
mycursor.execute('show databases')

In [7]:
for data in mycursor:
    print(data)

('information_schema',)
('cadastro',)
('mysql',)
('performance_schema',)
('sys',)

In [8]:
mydb = sql.connect(
    host = 'localhost',
    user = 'root',
    password = '25lokinho',
    database = 'cadastro',
)

In [9]:
mycursor = mydb.cursor()

In [10]:
mycursor.execute('select * from pessoas')
for data in mycursor:
    print(data)

(None, 1, 'Godofredo', 'naosabe', datetime.date(1984, 1, 2), 'M', Decimal('78.50'), Decimal('1.83'), 'Brasil')
(None, 2, 'Priscila', 'naosabe', datetime.date(1995, 1, 2), 'M', Decimal('51.50'), Decimal('1.63'), 'Brasil')
(None, 3, 'Priscila', 'naosabe', datetime.date(1995, 1, 2), 'M', Decimal('51.50'), Decimal('1.63'), 'Brasil')
(None, 4, 'Miguel', 'naosabe', datetime.date(1990, 10, 3), 'M', Decimal('76.50'), Decimal('1.79'), 'Brasil')
(None, 5, 'Junior', 'naosabe', datetime.date(1998, 10, 3), 'M', Decimal('75.50'), Decimal('1.70'), 'Brasil')
(None, 6, 'Fernando', 'naosabe', datetime.date(2000, 10, 3), 'M', Decimal('88.50'), Decimal('1.90'), 'Brasil')
(None, 7, 'Gui', 'naosabe', datetime.date(1993, 12, 8), 'M', Decimal('80.00'), Decimal('1.79'), 'Brasil')
(None, 8, 'Ana', 'naosabe', datetime.date(1965, 10, 3), 'F', Decimal('70.50'), Decimal('1.74'), 'Brasil')

# Fazendo com Pandas agora

In [11]:
import pandas as pd

In [12]:
mydb = sql.connect(
    host = 'localhost',
    user = 'root',
    password = '25lokinho',
    database = 'cadastro',
)

In [13]:
mycursor = mydb.cursor()

In [14]:
mycursor.execute('select * from pessoas')

In [15]:
df = pd.DataFrame(data = mycursor)

In [16]:
df # Ele não copia o nome das colunas

      0  1          2        3           4  5      6     7       8
0  None  1  Godofredo  naosabe  1984-01-02  M  78.50  1.83  Brasil
1  None  2   Priscila  naosabe  1995-01-02  M  51.50  1.63  Brasil
2  None  3   Priscila  naosabe  1995-01-02  M  51.50  1.63  Brasil
3  None  4     Miguel  naosabe  1990-10-03  M  76.50  1.79  Brasil
4  None  5     Junior  naosabe  1998-10-03  M  75.50  1.70  Brasil
5  None  6   Fernando  naosabe  2000-10-03  M  88.50  1.90  Brasil
6  None  7        Gui  naosabe  1993-12-08  M  80.00  1.79  Brasil
7  None  8        Ana  naosabe  1965-10-03  F  70.50  1.74  Brasil

### Mais eficiente usar a função do panda direto

In [17]:
mydb = sql.connect(
    host = 'localhost',
    user = 'root',
    password = '25lokinho',
    database = 'cadastro',
)

In [18]:
df = pd.read_sql('SELECT * FROM pessoas', con=mydb)

In [19]:
df

  codigo  id       nome     prof  nascimento sexo  peso  altura nacionalidade
0   None   1  Godofredo  naosabe  1984-01-02    M  78.5    1.83        Brasil
1   None   2   Priscila  naosabe  1995-01-02    M  51.5    1.63        Brasil
2   None   3   Priscila  naosabe  1995-01-02    M  51.5    1.63        Brasil
3   None   4     Miguel  naosabe  1990-10-03    M  76.5    1.79        Brasil
4   None   5     Junior  naosabe  1998-10-03    M  75.5    1.70        Brasil
5   None   6   Fernando  naosabe  2000-10-03    M  88.5    1.90        Brasil
6   None   7        Gui  naosabe  1993-12-08    M  80.0    1.79        Brasil
7   None   8        Ana  naosabe  1965-10-03    F  70.5    1.74        Brasil